# Data Visualization
----

In [2]:
# Dependencies

# Pandas
import pandas as pd
import sqlalchemy 
import psycopg2


#MatPlotLib/NumPy/SciPy

%matplotlib inline
from matplotlib import pyplot as plt
import numpy as np
import scipy.stats as stats

# SQL Alchemy
from sqlalchemy import create_engine

#connect to local database
engine = create_engine('postgresql://postgres:postgres@localhost/Employee_SQL')
connection = engine.connect()

In [3]:
engine.table_names()

C:\Users\User\anaconda3\envs\pythondata\lib\site-packages\ipykernel_launcher.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  """Entry point for launching an IPython kernel.

['departments',
 'employees',
 'dept_emp',
 'dept_manager',
 'salaries',
 'title_id']

In [45]:
employees= pd.read_sql('select * from employees', connection)
salaries= pd.read_sql('select * from salaries', connection)
titles= pd.read_sql('select DISTINCT title FROM title_id', connection)
dept_manager = pd.read_sql('select DISTINCT dept_no from dept_manager', connection)


#test 

employees
#salaries
#titles
#dept_manager

           emp emp_title  birth_date   first_name  last_name sex   hire_date
0       473302     s0001   7/25/1953     Hideyuki   Zallocco   M  1990-04-28
1       475053     e0002  11/18/1954        Byong  Delgrande   F  1991-09-07
2        57444     e0002   1/30/1958        Berry       Babb   F  1992-03-21
3       421786     s0001   9/28/1957        Xiong   Verhoeff   M  1987-11-26
4       282238     e0003  10/28/1952   Abdelkader    Baumann   F  1991-01-18
...        ...       ...         ...          ...        ...  ..         ...
300019  464231     s0001   8/14/1958  Constantino    Eastman   M  1988-10-28
300020  255832     e0002    5/8/1955       Yuping     Dayang   F  1995-02-26
300021   76671     s0001    6/9/1959       Ortrud   Plessier   M  1988-02-24
300022  264920     s0001   9/22/1959        Percy   Samarati   F  1994-09-08
300023  464503     s0002   5/31/1964       Arvind  Slobodova   M  1987-11-23

[300024 rows x 7 columns]

In [44]:
#salaries_emp= employees.merge(salaries, on='emp_no')